[
    {
        "text": "In a moment I'm going to tell you about a certain \nreally nice puzzle involving the shadow of a cube.  ",
        "start": 0.08,
        "duration": 4.16
    },
    {
        "text": "But before we get to that I should say that the \npoint of this video is not exactly the puzzle,  ",
        "start": 4.8,
        "duration": 4.08
    },
    {
        "text": "per se, it's about two distinct problem-solving \nstyles that are reflected in two different ways  ",
        "start": 8.88,
        "duration": 5.12
    },
    {
        "text": "that we can tackle this problem. In fact \nlet's anthropomorphize those two different  ",
        "start": 14.0,
        "duration": 3.68
    }, {
        "text": "styles by imagining two students, Alice and \nBob who embody each one of the approaches.",
        "start": 17.68,
        "duration": 4.96
    }, {
        "text": "So Bob will be the kind of student who really \nloves calculation. As soon as there's a moment  ",
        "start": 23.28,
        "duration": 4.8
    }, {
        "text": "when he can dig into the details and get a very \nconcrete view of the concrete situation in front  ",
        "start": 28.08,
        "duration": 4.32
    }, {
        "text": "of him, that's where he's the most pleased. \nAlice on the other hand is more inclined to  ",
        "start": 32.4,
        "duration": 4.8
    }, {
        "text": "procrastinate the computations, not because she \ndoesn't know how to do them or doesn't want to,  ",
        "start": 37.2,
        "duration": 4.48
    }, {
        "text": "per se, but she prefers to get a nice high-level \ngeneral overview of the kind of problem she's  ",
        "start": 41.68,
        "duration": 5.52
    }, {
        "text": "dealing with, the general shape that it has, \nbefore she digs into the computations themselves.  ",
        "start": 47.2,
        "duration": 4.08
    }, {
        "text": "She's most pleased if she understands not just \nthe specific question sitting in front of her,  ",
        "start": 52.0,
        "duration": 4.24
    }, {
        "text": "but also the broadest possible \nway that you could generalize it,  ",
        "start": 56.24,
        "duration": 3.6
    }, {
        "text": "and especially if the more general \nview can lend itself to more swift  ",
        "start": 59.84,
        "duration": 3.2
    }, {
        "text": "and elegant computations once she does \nactually sit down to carry them out.",
        "start": 63.04,
        "duration": 8.8
    }, {
        "text": "Now the puzzle that both of them are going to \nbe faced with is to find the average area for  ",
        "start": 73.12,
        "duration": 4.72
    }, {
        "text": "the shadow of a cube. So if I have a cube kind of \nsitting here hovering in space, there are, a few  ",
        "start": 77.84,
        "duration": 5.44
    }, {
        "text": "things that influence the area of its shadow. One \nobvious one would be the size of the cube, smaller  ",
        "start": 83.28,
        "duration": 4.88
    }, {
        "text": "cube smaller shadow. But also if it's sitting \nat different orientations, those orientations  ",
        "start": 88.16,
        "duration": 4.96
    }, {
        "text": "correspond to different particular shadows with \ndifferent areas. And when I say find the average  ",
        "start": 93.12,
        "duration": 4.64
    }, {
        "text": "here, what I mean is the average over all possible \norientations for a particular size of the cube.",
        "start": 97.76,
        "duration": 5.2
    }, {
        "text": "The astute among you might point out that it \nalso matters a lot where the light source is.  ",
        "start": 104.16,
        "duration": 4.08
    }, {
        "text": "If the light source were very low close to the \ncube itself then the shadow ends up larger and if  ",
        "start": 108.24,
        "duration": 4.96
    }, {
        "text": "the light source were kind of positioned laterally \noff to the side, this can distort the shadow and  ",
        "start": 113.2,
        "duration": 4.08
    }, {
        "text": "give it a very different shape. Accounting \nfor that light position stands to be highly  ",
        "start": 117.28,
        "duration": 4.16
    }, {
        "text": "interesting in its own right, but the puzzle is \nhard enough as it is, so at least initially let's  ",
        "start": 121.44,
        "duration": 4.48
    }, {
        "text": "do the easiest thing we can and say that the light \nis directly above the cube and really far away.  ",
        "start": 125.92,
        "duration": 5.6
    }, {
        "text": "Effectively infinitely far so that all we're \nconsidering is a flat projection, in the sense  ",
        "start": 131.52,
        "duration": 5.12
    }, {
        "text": "that if you look at any coordinates (x, y, z) \nin space the flat projection would be (x, y, 0)",
        "start": 136.64,
        "duration": 5.2
    }, {
        "text": "So just to get our bearings, the easiest \nsituation to think about would be if the cube is  ",
        "start": 142.48,
        "duration": 4.16
    }, {
        "text": "straight up with two of its faces parallel to the \nground. In that case this flat projection shadow  ",
        "start": 146.64,
        "duration": 5.12
    }, {
        "text": "is simply a square, and if we say the side lengths \nof the cube are s, then the area of that shadow is  ",
        "start": 151.76,
        "duration": 5.52
    }, {
        "text": "s squared. And by the way, anytime that I have \na label up on these animations like the one down  ",
        "start": 157.28,
        "duration": 4.8
    }, {
        "text": "here I'll be assuming that the relevant cube \nhas a side length of 1. Another special case  ",
        "start": 162.08,
        "duration": 5.04
    }, {
        "text": "among all the orientations that's fun to think \nabout is if the long diagonal is parallel to  ",
        "start": 167.12,
        "duration": 4.88
    }, {
        "text": "the direction of the light. In that case the \nshadow actually looks like a regular hexagon,  ",
        "start": 172.0,
        "duration": 4.4
    }, {
        "text": "and if you use some of the methods that we will \ndevelop in a few minutes, you can compute that the  ",
        "start": 176.4,
        "duration": 4.48
    }, {
        "text": "area of that shadow is exactly the square root of \nthree times the area of one of the square faces.  ",
        "start": 180.88,
        "duration": 4.88
    }, {
        "text": "But of course more often the actual shadow will \nnot be so regular as a square or a hexagon, it's  ",
        "start": 186.48,
        "duration": 5.2
    }, {
        "text": "some harder-to-think-about shape based on some \nharder-to-think-about orientation for this cube.",
        "start": 191.68,
        "duration": 4.48
    }, {
        "text": "Earlier, I casually threw out this phrase \nof averaging over all possible orientations,  ",
        "start": 197.12,
        "duration": 4.8
    }, {
        "text": "but you could rightly ask what exactly is \nthat supposed to mean. I think a lot of  ",
        "start": 201.92,
        "duration": 4.72
    }, {
        "text": "us have an intuitive feel for what we want \nit to mean, at least in the sense of what  ",
        "start": 206.64,
        "duration": 4.0
    }, {
        "text": "experiment would you do to verify it. You might \nimagine tossing this cube in the air like a die,  ",
        "start": 210.64,
        "duration": 5.6
    }, {
        "text": "freezing it at some arbitrary point, recording \nthe area of the shadow from that position,  ",
        "start": 216.24,
        "duration": 5.2
    }, {
        "text": "and then repeating. If you do this many many \ntimes over and over you can take the mean of  ",
        "start": 221.44,
        "duration": 6.24
    }, {
        "text": "your sample. The number that we want to get at, \nthe true average here, should be whatever that  ",
        "start": 227.68,
        "duration": 5.12
    }, {
        "text": "experimental mean approaches as you do more \nand more tosses approaching infinitely many.",
        "start": 232.8,
        "duration": 7.04
    }, {
        "text": "Even still, the sticklers among you could complain \nthat doesn't really answer the question, because  ",
        "start": 240.48,
        "duration": 4.24
    }, {
        "text": "it leaves open the issue of how we're defining \na \"random\" toss. The proper way to answer this,  ",
        "start": 244.72,
        "duration": 4.8
    }, {
        "text": "if we want it to be more formal, would be to first \ndescribe the space of all possible orientations,  ",
        "start": 249.52,
        "duration": 5.6
    }, {
        "text": "which mathematicians have actually \ngiven a fancy name. They call it SO(3),  ",
        "start": 255.12,
        "duration": 3.84
    }, {
        "text": "typically defined in terms of a certain family \nof 3-by-3 matrices. And the question we want  ",
        "start": 258.96,
        "duration": 4.72
    }, {
        "text": "to answer is \"What probability distribution are we \nputting to this entire space?\" It's only when such  ",
        "start": 263.68,
        "duration": 6.16
    }, {
        "text": "a probability distribution is well-defined that \nwe can answer a question involving an average.  ",
        "start": 269.84,
        "duration": 4.64
    }, {
        "text": "If you are a stickler for that kind of thing, I \nwant you to hold off on that question until the  ",
        "start": 275.68,
        "duration": 4.32
    }, {
        "text": "end of the video. You'll be surprised at how far \nwe can get with the more heuristic experimental  ",
        "start": 280.0,
        "duration": 4.32
    }, {
        "text": "idea of just repeating a bunch of random tosses \nwithout really defining the distribution.  ",
        "start": 284.32,
        "duration": 4.24
    }, {
        "text": "Once we see Alice and Bob's solutions, \nit's actually very interesting to ask  ",
        "start": 289.12,
        "duration": 3.84
    }, {
        "text": "how exactly each one of them defined \nthis distribution along their way.",
        "start": 292.96,
        "duration": 3.36
    }, {
        "text": "And remember, this is not meant to be \na lesson about cube shadows, per se,  ",
        "start": 297.84,
        "duration": 3.76
    }, {
        "text": "but a lesson about problem-solving told through \nthe lens of two different mindsets that we might  ",
        "start": 301.6,
        "duration": 4.48
    }, {
        "text": "bring to the puzzle. And as with any lesson \non problem-solving, the goal here is not to  ",
        "start": 306.08,
        "duration": 4.56
    }, {
        "text": "get to the answer as quickly as we can, but \nhopefully for you to feel like you found the  ",
        "start": 310.64,
        "duration": 4.24
    }, {
        "text": "answer yourself. So if ever there's a point \nwhen you feel like you might have an idea,  ",
        "start": 314.88,
        "duration": 3.52
    }, {
        "text": "give yourself the freedom to \npause and try to think it through.",
        "start": 318.4,
        "duration": 5.44
    }, {
        "text": "As a first step, and this is really independent \nof any particular problem-solving styles,  ",
        "start": 325.52,
        "duration": 4.16
    }, {
        "text": "just anytime you find a hard question, a \ngood thing that you can do is ask \"What's  ",
        "start": 329.68,
        "duration": 4.16
    }, {
        "text": "the simplest possible non-trivial variant \nof the problem that you can try to solve?\"  ",
        "start": 333.84,
        "duration": 4.56
    }, {
        "text": "In our case what you might say is, okay, let's \nforget about averaging over all the orientations.  ",
        "start": 339.44,
        "duration": 4.4
    }, {
        "text": "That's a tricky thing to think about. And let's \neven forget about all the different faces of  ",
        "start": 343.84,
        "duration": 3.84
    }, {
        "text": "the cube, because they overlap and that's also \ntricky to think about. Just for one particular  ",
        "start": 347.68,
        "duration": 4.8
    }, {
        "text": "face and one particular orientation, \ncan we compute the area of this shadow?",
        "start": 352.48,
        "duration": 4.4
    }, {
        "text": "Once more, if you want to get your bearings with \nsome special cases the easiest is when that face  ",
        "start": 357.52,
        "duration": 4.32
    }, {
        "text": "is parallel to the ground in which case the \narea of the shadow is the same as the area  ",
        "start": 361.84,
        "duration": 4.16
    }, {
        "text": "of the face. And on the other hand if we were to \ntilt that face 90-degrees, then its shadow will  ",
        "start": 366.0,
        "duration": 5.2
    }, {
        "text": "be a straight line and it has an area of zero. So \nBob looks at this and he wants an actual formula  ",
        "start": 371.2,
        "duration": 5.28
    }, {
        "text": "for that shadow, and the way he might think about \nit is to consider the normal vector perpendicular  ",
        "start": 376.48,
        "duration": 5.36
    }, {
        "text": "off of that face. What seems relevant is the angle \nthat that normal vector makes with the vertical,  ",
        "start": 381.84,
        "duration": 5.12
    }, {
        "text": "with the direction where the light is \ncoming from, which we might call theta.  ",
        "start": 386.96,
        "duration": 2.96
    }, {
        "text": "Now from the two special cases we just looked at, \nwe know that when theta is equal to 0, the area of  ",
        "start": 390.96,
        "duration": 5.28
    }, {
        "text": "that shadow is the same as the area of the shape \nitself, which is s squared if the square has side  ",
        "start": 396.24,
        "duration": 4.72
    }, {
        "text": "lengths s. And if theta is equal to 90 degrees, \nthen the area of that shadow is zero. And it's  ",
        "start": 400.96,
        "duration": 5.6
    }, {
        "text": "probably not too hard to guess that trigonometry \nwill be somehow relevant, so anyone comfortable  ",
        "start": 406.56,
        "duration": 4.24
    }, {
        "text": "with their trig functions could probably \nhazard a guess as to what the right formula is.",
        "start": 410.8,
        "duration": 4.08
    }, {
        "text": "But Bob is more detail-oriented than that. He \nwants to properly prove what that area should be  ",
        "start": 414.88,
        "duration": 4.72
    }, {
        "text": "rather than just making a guess based on the \nendpoints. The way you might think about it  ",
        "start": 419.6,
        "duration": 4.0
    }, {
        "text": "could be something like this. If we consider \nthe plane that passes through the vertical as  ",
        "start": 423.6,
        "duration": 4.4
    }, {
        "text": "well as our normal vector, and then we consider \nall the different slices of our shape that are  ",
        "start": 428.0,
        "duration": 4.88
    }, {
        "text": "in that plane, or parallel to that plane, then \nwe can focus our attention on a two-dimensional  ",
        "start": 432.88,
        "duration": 5.04
    }, {
        "text": "variant of the problem. If we just look at one \nof those slices, who has a normal vector an  ",
        "start": 437.92,
        "duration": 4.64
    }, {
        "text": "angle theta away from the vertical, its shadow \nmight look something like this. And if we draw  ",
        "start": 442.56,
        "duration": 5.28
    }, {
        "text": "a vertical line up to the left here, we have \nourselves a right triangle. And from here we  ",
        "start": 447.84,
        "duration": 4.08
    }, {
        "text": "can do a little bit of angle chasing, where we \nfollow around what that angle theta implies about  ",
        "start": 451.92,
        "duration": 4.48
    }, {
        "text": "the rest of the diagram. And this means the lower \nright angle in this triangle is precisely theta.",
        "start": 456.4,
        "duration": 5.68
    }, {
        "text": "So when we want to understand the size of this \nshadow in comparison to the original size of  ",
        "start": 463.28,
        "duration": 5.36
    }, {
        "text": "the piece, we can think about the cosine of that \nangle theta, which remember is the adjacent over  ",
        "start": 468.64,
        "duration": 5.12
    }, {
        "text": "the hypotenuse. It's literally the ratio between \nthe size of the shadow and the size of the slice.  ",
        "start": 473.76,
        "duration": 4.32
    }, {
        "text": "So the factor by which the slice gets squished \ndown in this direction is exactly cosine of theta.  ",
        "start": 478.8,
        "duration": 5.44
    }, {
        "text": "And if we broaden our view to the entire square \nall the slices in that direction get scaled by  ",
        "start": 484.96,
        "duration": 4.32
    }, {
        "text": "the same factor. But in the other direction, \nthe one perpendicular to that slice, there is  ",
        "start": 489.28,
        "duration": 5.04
    }, {
        "text": "no stretching or squishing because the face is \nnot at all tilted in that direction. So overall  ",
        "start": 494.32,
        "duration": 5.44
    }, {
        "text": "the two-dimensional shadow of our two-dimensional \nface should also be scaled down by this factor of  ",
        "start": 499.76,
        "duration": 4.8
    }, {
        "text": "a cosine of theta. It lines up with what you \nmight intuitively guess given the case where  ",
        "start": 504.56,
        "duration": 4.24
    }, {
        "text": "the angle is 0 degrees and the case where it's 90 \ndegrees, but it's reassuring to see why it's true",
        "start": 508.8,
        "duration": 4.4
    }, {
        "text": "Actually, as stated so far, this is not \nquite correct. There is a small problem  ",
        "start": 515.2,
        "duration": 4.24
    }, {
        "text": "with the formula that we've written. In the \ncase where theta is bigger than 90 degrees,  ",
        "start": 519.44,
        "duration": 4.56
    }, {
        "text": "the cosine would actually come out to be \nnegative, but of course we don't want to  ",
        "start": 524.0,
        "duration": 3.52
    }, {
        "text": "consider the shadow to have negative area. At \nleast not in a problem like this. So there's  ",
        "start": 527.52,
        "duration": 4.4
    }, {
        "text": "two different ways you could solve this. You \ncould say we only ever want to consider the  ",
        "start": 531.92,
        "duration": 3.04
    }, {
        "text": "normal vector that is pointing up, that has a \npositive z component. Or more simply we could  ",
        "start": 534.96,
        "duration": 5.04
    }, {
        "text": "say just take the absolute value of that \ncosine, and that gives us a valid formula.",
        "start": 540.0,
        "duration": 4.56
    }, {
        "text": "So bob's happy because he has a precise \nformula describing the area of the shadow,  ",
        "start": 546.72,
        "duration": 4.08
    }, {
        "text": "but Alice starts to think about it a little bit \ndifferently. She says, okay we've got some shape,  ",
        "start": 551.36,
        "duration": 5.04
    }, {
        "text": "and then we apply a rotation that sort of situates \nit into 3d space in some way, and then we apply  ",
        "start": 556.4,
        "duration": 5.12
    }, {
        "text": "a flat projection that shoves that back into \ntwo-dimensional space. And what stands out to her  ",
        "start": 561.52,
        "duration": 4.48
    }, {
        "text": "is that both of these are linear transformations. \nThat means that in principle you could describe  ",
        "start": 566.0,
        "duration": 4.88
    }, {
        "text": "each one of them with a matrix, and that the \noverall transformation would look like the product  ",
        "start": 570.88,
        "duration": 4.32
    }, {
        "text": "of those two matrices. What Alice knows from \none of her favorite subjects, linear algebra, is  ",
        "start": 575.2,
        "duration": 5.04
    }, {
        "text": "that if you take some shape and you consider its \narea, then you apply some linear transformation,  ",
        "start": 580.24,
        "duration": 4.32
    }, {
        "text": "the area of that output looks like some constant \ntimes the original area of the shape. More  ",
        "start": 585.28,
        "duration": 5.6
    }, {
        "text": "specifically we have a name for that constant, \nit's called the determinant of the transformation.",
        "start": 590.88,
        "duration": 4.08
    }, {
        "text": "If you're not so comfortable with linear algebra, \nwe could give a much more intuitive description  ",
        "start": 596.48,
        "duration": 3.68
    }, {
        "text": "and say if you uniformly stretch the original \nshape in some direction, the output will also  ",
        "start": 600.16,
        "duration": 5.2
    }, {
        "text": "uniformly get stretched in some direction. So the \narea of each of them should scale in proportion  ",
        "start": 605.36,
        "duration": 5.04
    }, {
        "text": "to each other. Now, in principle Alice could \ncompute this determinant. But it's not really  ",
        "start": 610.4,
        "duration": 5.12
    }, {
        "text": "her style to do that, at least not to do so \nimmediately. Instead the thing that she writes  ",
        "start": 615.52,
        "duration": 4.48
    }, {
        "text": "down is how this proportionality constant between \nour original shape and its shadow does not depend  ",
        "start": 620.0,
        "duration": 5.92
    }, {
        "text": "on the original shape. We could be talking about \nthe shadow of this cat outline, or anything else,  ",
        "start": 625.92,
        "duration": 5.04
    }, {
        "text": "and the size of it doesn't really matter, the \nonly thing affecting that proportionality constant  ",
        "start": 630.96,
        "duration": 4.64
    }, {
        "text": "is what transformation we're applying, which in \nthis context means we could write it down as some  ",
        "start": 635.6,
        "duration": 4.4
    }, {
        "text": "factor that depends on the rotation being applied \nto the shape. In the back of our mind because of  ",
        "start": 640.0,
        "duration": 5.6
    }, {
        "text": "bob's calculation we know what that factor looks \nlike, you know it's the absolute value of the  ",
        "start": 645.6,
        "duration": 4.08
    }, {
        "text": "cosine of the angle between the normal vector and \nthe vertical. But Alice right now is just saying,  ",
        "start": 649.68,
        "duration": 4.64
    }, {
        "text": "\"yeah, yeah, I can think about that eventually \nwhen I want to.\" But she knows we're about to  ",
        "start": 654.32,
        "duration": 3.68
    }, {
        "text": "average over all the different orientations \nanyway, so she holds out some hope that any  ",
        "start": 658.0,
        "duration": 4.16
    }, {
        "text": "specific formula about a specific orientation \nmight get washed away in that average.",
        "start": 662.16,
        "duration": 4.48
    }, {
        "text": "Now it's easy to look at this and say, \"Okay, \nwell Alice isn't really doing anything then!\"  ",
        "start": 667.92,
        "duration": 3.68
    }, {
        "text": "Of course the area of the shadow is \nproportional to the area of the original shape,  ",
        "start": 671.6,
        "duration": 4.08
    }, {
        "text": "they're both two-dimensional quantities, they \nshould both scale like two-dimensional things.",
        "start": 675.68,
        "duration": 4.24
    }, {
        "text": "But keep in mind this would not at all be \ntrue if we were dealing with the harder  ",
        "start": 679.92,
        "duration": 4.0
    }, {
        "text": "case that has a closer light source. In \nthat case the projection is not linear.  ",
        "start": 683.92,
        "duration": 4.4
    }, {
        "text": "So for example if I rotate this cat so that its \ntail ends up quite close to the light source,  ",
        "start": 688.32,
        "duration": 4.64
    }, {
        "text": "then if I stretch the original \nshape uniformly in the x direction,  ",
        "start": 692.96,
        "duration": 3.36
    }, {
        "text": "say by a factor of 1.5, it might have a very \ndisproportionate effect on the ultimate shadow,  ",
        "start": 696.32,
        "duration": 5.6
    }, {
        "text": "because the tail gets very disproportionately \nblown up as it gets really close to the light.",
        "start": 701.92,
        "duration": 4.08
    }, {
        "text": "Again, Alice is keeping an eye out for what \nproperties of the problem are actually relevant,  ",
        "start": 706.64,
        "duration": 4.16
    }, {
        "text": "because that helps her know how much she \ncan generalize things. Does the fact that  ",
        "start": 710.8,
        "duration": 3.52
    }, {
        "text": "we're thinking about a square face and not \nsome other shape matter? No not really. Does  ",
        "start": 714.32,
        "duration": 4.88
    }, {
        "text": "the fact that the transformation \nis linear matter? Yes, absolutely.",
        "start": 719.2,
        "duration": 3.52
    }, {
        "text": "Alice can also apply a similar way of \nthinking about the average shadow for  ",
        "start": 726.56,
        "duration": 4.08
    }, {
        "text": "any shape like this. Say we have some sequence \nof rotations that we apply to our square face,  ",
        "start": 730.64,
        "duration": 5.68
    }, {
        "text": "and let's call them R1, R2, R3, and so on. Then \nthe area of the shadow in each one of those cases  ",
        "start": 736.32,
        "duration": 6.32
    }, {
        "text": "looks like some factor times the area of the \nsquare, and that factor depends on the rotation.  ",
        "start": 742.64,
        "duration": 4.56
    }, {
        "text": "So if we take an empirical average \nfor that shadow across the sample of  ",
        "start": 747.84,
        "duration": 3.36
    }, {
        "text": "rotations we're looking at right now, \nthe way it looks is to add up all of  ",
        "start": 751.2,
        "duration": 3.76
    }, {
        "text": "those shadow areas and then divide \nby the total number that we have.",
        "start": 754.96,
        "duration": 3.2
    }, {
        "text": "Now, because of the linearity, this area of the \noriginal square can cleanly factor out of all of  ",
        "start": 758.72,
        "duration": 6.24
    }, {
        "text": "that, and it ends up on the left. This isn't the \nexact average that we're looking for, it's just  ",
        "start": 764.96,
        "duration": 4.56
    }, {
        "text": "an empirical mean of a sample of rotations. But \nin principle what we're looking for is what this  ",
        "start": 769.52,
        "duration": 4.96
    }, {
        "text": "approaches as the size of our sample approaches \ninfinity. And all the parts that depend on the  ",
        "start": 774.48,
        "duration": 4.96
    }, {
        "text": "size of the sample sit cleanly away from the area \nitself. So whatever this approaches, in the limit  ",
        "start": 779.44,
        "duration": 5.68
    }, {
        "text": "it's just going to be some number. It might be \na royal pain to compute, we're not sure about  ",
        "start": 785.12,
        "duration": 3.76
    }, {
        "text": "that yet, but the thing that Alice notes is that \nit's independent of the size and the shape of the  ",
        "start": 788.88,
        "duration": 4.64
    }, {
        "text": "particular 2d thing that we're looking at. It's a \nuniversal proportionality constant, and her hope  ",
        "start": 793.52,
        "duration": 5.76
    }, {
        "text": "is that that universality somehow lends itself \nto a more elegant way to deduce what it must be.  ",
        "start": 799.28,
        "duration": 5.12
    }, {
        "text": "Now Bob would be eager to compute \nthis constant here and now,  ",
        "start": 806.0,
        "duration": 3.44
    }, {
        "text": "and in a few minutes I'll show you how he \ndoes it. But before that, I do want to stay  ",
        "start": 809.44,
        "duration": 3.68
    }, {
        "text": "in Alice's world for a little bit more, because \nthis is where things start to really get fun.",
        "start": 813.12,
        "duration": 3.52
    }, {
        "text": "In her desire to understand the overall structure \nof the question before diving into the details,  ",
        "start": 820.16,
        "duration": 4.96
    }, {
        "text": "she's curious now about how the area of the \nshadow of the cube relates to the area of its  ",
        "start": 825.12,
        "duration": 4.96
    }, {
        "text": "individual faces. If we can say something about \nthe average area of a particular face, does that  ",
        "start": 830.08,
        "duration": 5.2
    }, {
        "text": "tell us anything about the average area of the \ncube as a whole? For example, a simple thing we  ",
        "start": 835.28,
        "duration": 4.96
    }, {
        "text": "could say is that that area is definitely less \nthan the sum of the areas across all the faces,  ",
        "start": 840.24,
        "duration": 5.44
    }, {
        "text": "because there's a meaningful amount of overlap \nbetween those shadows. But it's not entirely clear  ",
        "start": 845.68,
        "duration": 5.36
    }, {
        "text": "how to think about that overlap, because if we \nfocus our attention just on two particular faces,  ",
        "start": 851.04,
        "duration": 4.96
    }, {
        "text": "in some orientations they don't overlap at \nall, but in other orientations they do have  ",
        "start": 856.0,
        "duration": 4.16
    }, {
        "text": "some overlap. The specific shape and area of that \noverlap seems a little bit tricky to think about,  ",
        "start": 860.16,
        "duration": 5.2
    }, {
        "text": "much less how on earth we would average that \nacross all of the different orientations.",
        "start": 865.36,
        "duration": 4.48
    }, {
        "text": "But Alice has about three clever \ninsights through this whole problem,  ",
        "start": 870.4,
        "duration": 3.68
    }, {
        "text": "and this is the first one of them. She says, \nactually, if we think about the whole cube,  ",
        "start": 874.08,
        "duration": 4.88
    }, {
        "text": "not just a pair of faces, we can conclude that \nthe area of the shadow for a given orientation  ",
        "start": 878.96,
        "duration": 5.36
    }, {
        "text": "is exactly one-half the sum of \nthe areas of all of the faces.  ",
        "start": 884.32,
        "duration": 3.68
    }, {
        "text": "Intuitively, you can maybe guess that half of them \nare bathed in the light, and half of them are not.  ",
        "start": 889.28,
        "duration": 4.48
    }, {
        "text": "But here's the way that she justifies it. \nShe says for a particular ray of light  ",
        "start": 893.76,
        "duration": 4.4
    }, {
        "text": "they would go from the sky and eventually hit a \npoint in the shadow, that ray passes through the  ",
        "start": 898.16,
        "duration": 4.88
    }, {
        "text": "cube at exactly two points. There's one moment \nwhen it enters, and one moment when it exits,  ",
        "start": 903.04,
        "duration": 4.96
    }, {
        "text": "so every point in that shadow corresponds to \nexactly two faces above it. Well, okay, that's not  ",
        "start": 908.0,
        "duration": 7.2
    }, {
        "text": "exactly true. If that beam of light happened to go \nthrough the edge of one of the squares, there's a  ",
        "start": 915.2,
        "duration": 4.48
    }, {
        "text": "little bit of ambiguity on how many faces it's \npassing. But those account for zero area inside  ",
        "start": 919.68,
        "duration": 5.04
    }, {
        "text": "the shadow, so we're safe to ignore them if the \nthing we're trying to do is compute the area.",
        "start": 924.72,
        "duration": 4.16
    }, {
        "text": "If Alice is pressed and she needs to justify \nwhy exactly this is true, which is important  ",
        "start": 931.12,
        "duration": 4.72
    }, {
        "text": "for understanding how the problem might \ngeneralize, she can appeal to the idea of  ",
        "start": 935.84,
        "duration": 4.08
    }, {
        "text": "convexity. Convexity is one of those properties \nwhere a lot of us have an intuitive sense for  ",
        "start": 939.92,
        "duration": 4.64
    }, {
        "text": "what it should mean. You know, it's shapes \nthat just bulge out, they never dent inward.  ",
        "start": 944.56,
        "duration": 4.32
    }, {
        "text": "But mathematicians have a pretty clever way of \nformalizing it that's helpful for actual proofs",
        "start": 948.88,
        "duration": 4.08
    }, {
        "text": "They say that a set is \"convex\" if the line \nthat connects any two points inside that set  ",
        "start": 953.52,
        "duration": 5.6
    }, {
        "text": "is entirely contained within the set itself. So a \nsquare is convex because no matter where you put  ",
        "start": 959.12,
        "duration": 5.92
    }, {
        "text": "two points inside that square, the line connecting \nthem is entirely contained inside the square.",
        "start": 965.04,
        "duration": 4.96
    }, {
        "text": "But something like the symbol pi is not \nconvex. I can easily find two different points  ",
        "start": 970.0,
        "duration": 4.64
    }, {
        "text": "so that the line connecting them has to peak \noutside of the set itself. None of the letters  ",
        "start": 974.64,
        "duration": 4.96
    }, {
        "text": "in the word \"convex\" are themselves convex. You \ncan find two points so that the line connecting  ",
        "start": 979.6,
        "duration": 5.44
    }, {
        "text": "them has to pass outside of the set. It's a really \nclever way to formalize this idea of a shape that  ",
        "start": 985.04,
        "duration": 5.2
    }, {
        "text": "only bulges out, because any time that it dents \ninward, you can find these counter-example lines",
        "start": 990.24,
        "duration": 5.52
    }, {
        "text": "For our cube, because it's convex, between the \nfirst point of entry and the last point of exit  ",
        "start": 995.76,
        "duration": 5.44
    }, {
        "text": "it has to stay entirely inside the cube, by the \ndefinition of convexity. But if we were dealing  ",
        "start": 1001.2,
        "duration": 5.04
    }, {
        "text": "with some other non-convex shape, like a donut, \nyou could find a ray of light that enters then  ",
        "start": 1006.24,
        "duration": 4.96
    }, {
        "text": "exits then enters and exits again. So you wouldn't \nhave a clean two-to-one cover from the shadows.  ",
        "start": 1011.2,
        "duration": 5.2
    }, {
        "text": "The shadows of all of its different parts, if \nyou were to cover this in a bunch of faces,  ",
        "start": 1016.4,
        "duration": 4.24
    }, {
        "text": "would not be precisely two times \nthe area of the shadow itself.",
        "start": 1020.64,
        "duration": 3.2
    }, {
        "text": "So that's the first key insight, the face \nshadows double-cover the cube shadow.  ",
        "start": 1024.48,
        "duration": 4.08
    }, {
        "text": "And the next one is a little bit more \nsymbolic, so let's start things off by  ",
        "start": 1028.56,
        "duration": 3.28
    }, {
        "text": "abbreviating our notation a little to make room on \nthe screen. Instead of writing Area(Shadow(Cube)),  ",
        "start": 1031.84,
        "duration": 4.48
    }, {
        "text": "I'm just going to write S(Cube). And similarly \ninstead of Area(Shadow(a particular face)), I'm  ",
        "start": 1037.76,
        "duration": 5.76
    }, {
        "text": "just going to write S(F_j), where that subscript \nj indicates which face I'm talking about.",
        "start": 1043.52,
        "duration": 4.72
    }, {
        "text": "But of course, we should really be talking about \nthe shadow of a particular rotation applied to the  ",
        "start": 1049.04,
        "duration": 4.16
    }, {
        "text": "cube, so I might write this as S of some rotation \napplied to the cube. And likewise on the right,  ",
        "start": 1053.2,
        "duration": 5.28
    }, {
        "text": "it's the area of the shadow of that same \nrotation applied to a given one of the faces.",
        "start": 1058.48,
        "duration": 5.12
    }, {
        "text": "With the more compact notation at hand, let's \nthink about the average of this shadow area across  ",
        "start": 1063.6,
        "duration": 5.6
    }, {
        "text": "many different rotations, some sample of R1, R2, \nR3, and so on. Again, that average just involves  ",
        "start": 1069.2,
        "duration": 6.64
    }, {
        "text": "adding up all of those shadow areas and then \ndividing them by n, and in principle if we were  ",
        "start": 1075.84,
        "duration": 5.12
    }, {
        "text": "to look at this for larger and larger samples, \nletting n approach infinity, that would give us  ",
        "start": 1080.96,
        "duration": 4.4
    }, {
        "text": "the average area of the shadow of the cube. Some \nof you might be thinking, \"yes, we know this,  ",
        "start": 1085.36,
        "duration": 4.56
    }, {
        "text": "you've said this already.\" But it's beneficial to \nwrite it out so that we can understand why it is  ",
        "start": 1089.92,
        "duration": 4.32
    }, {
        "text": "that expressing the shadow area for a particular \nrotation of the cube as a sum across all of its  ",
        "start": 1094.24,
        "duration": 5.04
    }, {
        "text": "faces, or one half times that sum at least...why \nis that beneficial? What is that going to do for  ",
        "start": 1099.28,
        "duration": 5.12
    }, {
        "text": "us? Well, let's just write it out, where for \neach one of these rotations of the cube we  ",
        "start": 1104.4,
        "duration": 4.4
    }, {
        "text": "could break down that shadow as a sum across that \nsame rotation applied across all of the faces. And  ",
        "start": 1108.8,
        "duration": 5.68
    }, {
        "text": "when it's written as a grid like this, we can get \nto Alice's second insight, which is to shift the  ",
        "start": 1114.48,
        "duration": 4.48
    }, {
        "text": "way that we're thinking about the sum from going \nrow-by-row to instead going column-by-column.",
        "start": 1118.96,
        "duration": 4.64
    }, {
        "text": "For example if we focused our attention just \non the first column, what it's telling us is  ",
        "start": 1125.92,
        "duration": 4.24
    }, {
        "text": "to add up the area of the shadow of the first \nface across many different orientations. So if  ",
        "start": 1130.16,
        "duration": 5.52
    }, {
        "text": "we were to take that sum and divide it by the \nsize of our sample, that gives us an empirical  ",
        "start": 1135.68,
        "duration": 4.64
    }, {
        "text": "average for the area of the shadow of this \nface. So if we take larger and larger samples,  ",
        "start": 1140.32,
        "duration": 5.04
    }, {
        "text": "letting that size go to infinity, this will \napproach the average shadow area for a square.  ",
        "start": 1145.36,
        "duration": 4.48
    }, {
        "text": "Likewise, the second column \ncan be thought of as telling us  ",
        "start": 1151.84,
        "duration": 3.12
    }, {
        "text": "the average area for the second face of the \ncube, which should of course be the same number.  ",
        "start": 1154.96,
        "duration": 5.12
    }, {
        "text": "And same deal for any other column, it's telling \nus the average area for a particular face.",
        "start": 1160.08,
        "duration": 4.64
    }, {
        "text": "So that gives us a very different way \nof thinking about our whole expression.  ",
        "start": 1164.72,
        "duration": 3.6
    }, {
        "text": "Instead of saying add up the areas of the \ncubes at all the different orientations,  ",
        "start": 1168.32,
        "duration": 4.0
    }, {
        "text": "we could say just add up the average \nshadows for the six different faces  ",
        "start": 1172.32,
        "duration": 3.68
    }, {
        "text": "and multiply the total by one half. The term \non the left here is thinking about adding up  ",
        "start": 1176.0,
        "duration": 4.08
    }, {
        "text": "rows first, and the term on the right is \nthinking about adding up columns first.",
        "start": 1180.08,
        "duration": 3.52
    }, {
        "text": "In short, the average of \nthe sum of the face shadows  ",
        "start": 1184.8,
        "duration": 3.04
    }, {
        "text": "is the same as the sum of the average of the \nface shadows. Maybe that swap seems simple,  ",
        "start": 1187.84,
        "duration": 5.28
    }, {
        "text": "maybe it doesn't, but I can tell you \nthat there is actually a little bit  ",
        "start": 1193.12,
        "duration": 2.88
    }, {
        "text": "more than meets the eye to the step that \nwe just took. But we'll get to that later.",
        "start": 1196.0,
        "duration": 3.6
    }, {
        "text": "And remember, we know that the \naverage area for a particular face  ",
        "start": 1200.56,
        "duration": 3.28
    }, {
        "text": "looks like some universal proportionality \nconstant times the area of that face,  ",
        "start": 1203.84,
        "duration": 4.64
    }, {
        "text": "so if we're adding this up across all the faces \nof the cube, we could think of this as equaling  ",
        "start": 1208.48,
        "duration": 4.32
    }, {
        "text": "some constant times the surface area of \nthe cube. And that's pretty interesting,  ",
        "start": 1212.8,
        "duration": 4.0
    }, {
        "text": "the average area for the shadow of this cube is \ngoing to be proportional to its surface area.  ",
        "start": 1216.8,
        "duration": 4.56
    }, {
        "text": "But at the same time, you might complain, \"Well \nAlice is just pushing around a bunch of symbols  ",
        "start": 1222.48,
        "duration": 4.24
    }, {
        "text": "here, because none of this matters if we don't \nknow what that proportionality constant is!\"",
        "start": 1226.72,
        "duration": 4.24
    }, {
        "text": "I mean it almost seems obvious. Like, of course \nthe average shadow area should be proportional to  ",
        "start": 1231.52,
        "duration": 5.2
    }, {
        "text": "the surface area, they're both two-dimensional \nquantities, so they should scale in lock step  ",
        "start": 1236.72,
        "duration": 4.64
    }, {
        "text": "with each other. It's not obvious. After all, \nfor a closer light source it simply wouldn't  ",
        "start": 1241.36,
        "duration": 5.28
    }, {
        "text": "be true. And also this business where we added \nup the grid column-by-column versus row-by-row  ",
        "start": 1246.64,
        "duration": 5.6
    }, {
        "text": "is a little more nuanced than it might \nlook at first, there's a subtle hidden  ",
        "start": 1252.24,
        "duration": 4.08
    }, {
        "text": "assumption underlying all of this which carries \na special significance when we choose to revisit  ",
        "start": 1256.32,
        "duration": 4.48
    }, {
        "text": "the question of what probability distribution is \nbeing taken across the space of all orientations.",
        "start": 1260.8,
        "duration": 5.36
    }, {
        "text": "But more than anything, the reason that it's \nnot obvious is that the significance of this  ",
        "start": 1267.44,
        "duration": 4.16
    }, {
        "text": "result right here is not merely that these two \nvalues are proportional. It's that an analogous  ",
        "start": 1271.6,
        "duration": 5.44
    }, {
        "text": "fact will hold true for any convex solids, and \ncrucially, the actual content of what Alice  ",
        "start": 1277.04,
        "duration": 5.84
    }, {
        "text": "has built up so far is that it'll be the same \nproportionality constant across all of them.  ",
        "start": 1282.88,
        "duration": 4.88
    }, {
        "text": "Now if you really mull over that, some of you \nmay be able to predict the way that Alice is  ",
        "start": 1289.04,
        "duration": 3.6
    }, {
        "text": "able to finish things off from here. It's really \ndelightful, it's honestly my main reason for  ",
        "start": 1292.64,
        "duration": 4.24
    }, {
        "text": "covering this topic. But before we get into it, \nI think it's easy to under-appreciate her result  ",
        "start": 1296.88,
        "duration": 5.36
    }, {
        "text": "unless we dig into the details of \nwhat it is that she manages to avoid.",
        "start": 1302.24,
        "duration": 3.76
    }, {
        "text": "So let's take a moment to turn our \nattention back into Bob's world  ",
        "start": 1306.56,
        "duration": 3.36
    }, {
        "text": "because while Alice has been doing all of this, \nhe's been busy doing some computations. In fact,  ",
        "start": 1309.92,
        "duration": 5.44
    }, {
        "text": "what he's been working on is finding exactly \nwhat Alice has yet to figure out, which is how to  ",
        "start": 1315.36,
        "duration": 4.88
    }, {
        "text": "take the formula that he found for the area of a \nsquare's shadow, and taking the natural next step  ",
        "start": 1320.24,
        "duration": 4.64
    }, {
        "text": "of trying to find the average of that square's \nshadow, averaged over all possible orientations.",
        "start": 1324.88,
        "duration": 6.96
    }, {
        "text": "The way Bob starts, if he's thinking about all the \ndifferent possible orientations for this square,  ",
        "start": 1334.48,
        "duration": 4.56
    }, {
        "text": "is to ask what are all the different normal \nvectors that that square can have in all  ",
        "start": 1339.04,
        "duration": 4.08
    }, {
        "text": "these orientations. Because everything about \nits shadow comes down to that normal vector.  ",
        "start": 1343.12,
        "duration": 4.48
    }, {
        "text": "It's not too hard to see that all those possible \nnormal vectors trace out the surface of a sphere.  ",
        "start": 1347.6,
        "duration": 4.88
    }, {
        "text": "If we assume it's a unit normal vector, it's a \nsphere with radius 1. And furthermore, Bob figures  ",
        "start": 1352.48,
        "duration": 4.96
    }, {
        "text": "that each point of the sphere should be just as \nlikely to occur as any other, our probabilities  ",
        "start": 1357.44,
        "duration": 5.12
    }, {
        "text": "should be uniform in that way. There's no \nreason to prefer one direction over another.  ",
        "start": 1362.56,
        "duration": 3.68
    }, {
        "text": "But in the context of continuous probabilities \nit's not very helpful to talk about the likelihood  ",
        "start": 1366.88,
        "duration": 4.32
    }, {
        "text": "of a particular individual point, because in the \nuncountable infinity of points on the sphere,  ",
        "start": 1371.2,
        "duration": 4.48
    }, {
        "text": "that would be zero and unhelpful. So instead \nthe more precise way to phrase this uniformity  ",
        "start": 1375.68,
        "duration": 5.52
    }, {
        "text": "would be to say the probability that our normal \nvector lands in any given patch of area on the  ",
        "start": 1381.2,
        "duration": 4.64
    }, {
        "text": "sphere should be proportional to that area itself. \nMore specifically it should equal the area of that  ",
        "start": 1385.84,
        "duration": 6.0
    }, {
        "text": "little patch divided by the total surface area \nof the sphere. If that's true no matter what  ",
        "start": 1391.84,
        "duration": 4.96
    }, {
        "text": "patch of area we're considering, that's what we \nmean by a uniform distribution on the sphere.",
        "start": 1396.8,
        "duration": 4.24
    }, {
        "text": "Now to be clear, points on the sphere are not \nthe same thing as orientations in 3d space,  ",
        "start": 1401.68,
        "duration": 4.64
    }, {
        "text": "because even if you know what normal \nvector the square is going to have  ",
        "start": 1406.32,
        "duration": 3.52
    }, {
        "text": "that leaves us with another degree of freedom. The \nsquare could be rotated about that normal vector.  ",
        "start": 1409.84,
        "duration": 4.24
    }, {
        "text": "but Bob doesn't actually have to care about that \nextra degree of freedom, because in all of those  ",
        "start": 1414.72,
        "duration": 4.48
    }, {
        "text": "cases the area of the shadow is the same. It's \nonly dependent on the cosine of the angle between  ",
        "start": 1419.2,
        "duration": 5.76
    }, {
        "text": "that normal vector and the vertical, which is \nkind of neat. All those shadows are genuinely  ",
        "start": 1424.96,
        "duration": 4.4
    }, {
        "text": "different shapes, they're not the same, but \nthe area of each of them will be the same.",
        "start": 1429.36,
        "duration": 4.08
    }, {
        "text": "What this means is that when Bob wants \nthis average shadow area over all possible  ",
        "start": 1434.88,
        "duration": 3.68
    }, {
        "text": "orientations, all he really needs to know is the \naverage value of this absolute value of cosine of  ",
        "start": 1438.56,
        "duration": 5.12
    }, {
        "text": "theta for all different possible normal vectors, \nall different possible points on the sphere.",
        "start": 1443.68,
        "duration": 5.2
    }, {
        "text": "So how do you compute an average like this? \nWell if we lived in some kind of discrete,  ",
        "start": 1448.88,
        "duration": 5.04
    }, {
        "text": "pixelated world, where there's only a finite \nnumber of possible angles theta that that  ",
        "start": 1453.92,
        "duration": 4.4
    }, {
        "text": "normal vector could have, the average would be \npretty straightforward. What you do is find the  ",
        "start": 1458.32,
        "duration": 4.8
    }, {
        "text": "probability of landing on any particular value of \ntheta, which will tell us something like how much  ",
        "start": 1463.12,
        "duration": 4.72
    }, {
        "text": "of the sphere do normal vectors with that angle \nmake up, and then you multiply it by the thing we  ",
        "start": 1467.84,
        "duration": 4.64
    }, {
        "text": "want to take the average of, this formula for the \narea of the shadow. And then you would add that up  ",
        "start": 1472.48,
        "duration": 5.44
    }, {
        "text": "over all of the different possible values of theta \nranging from 0 up to 180 degrees, or pi radians.",
        "start": 1477.92,
        "duration": 5.92
    }, {
        "text": "But of course in reality there is a \ncontinuum of possible values of theta  ",
        "start": 1484.8,
        "duration": 4.08
    }, {
        "text": "this uncountable infinity, and the probability of \nlanding on any specific particular value of theta  ",
        "start": 1488.88,
        "duration": 6.0
    }, {
        "text": "will actually be zero, and so a sum like this \nunfortunately doesn't really make any sense.  ",
        "start": 1494.88,
        "duration": 5.36
    }, {
        "text": "Or if it does make sense, adding up infinitely \nmany zeros should just give us a zero.",
        "start": 1500.24,
        "duration": 3.84
    }, {
        "text": "The short answer for what we do instead is that \nwe compute an integral. And I'll level with you,  ",
        "start": 1505.6,
        "duration": 4.8
    }, {
        "text": "the hard part here is I'm not entirely sure what \nbackground I should be assuming from those of  ",
        "start": 1510.4,
        "duration": 3.68
    }, {
        "text": "you watching right now. Maybe it's the case \nthat you're quite comfortable with calculus,  ",
        "start": 1514.08,
        "duration": 3.76
    }, {
        "text": "and you don't need me to belabor the point here. \nMaybe it's the case that you're not familiar with  ",
        "start": 1517.84,
        "duration": 3.92
    }, {
        "text": "calculus, and I shouldn't just be throwing down \nintegrals like that. Or maybe you...you know,  ",
        "start": 1521.76,
        "duration": 4.08
    }, {
        "text": "you took a calculus class a while ago \nbut you need a little bit of a refresher.",
        "start": 1525.84,
        "duration": 3.92
    }, {
        "text": "I'm gonna go with the option of setting \nthis up as if it's a calculus lesson,  ",
        "start": 1529.76,
        "duration": 3.6
    }, {
        "text": "because to be honest even when \nyou are quite comfortable with  ",
        "start": 1533.36,
        "duration": 2.24
    }, {
        "text": "integrals setting them up can be \nkind of an error-prone process,  ",
        "start": 1535.6,
        "duration": 2.96
    }, {
        "text": "and calling back to the underlying definition is a \ngood way to sort of check yourself in the process.",
        "start": 1538.56,
        "duration": 4.32
    }, {
        "text": "If we lived in a time before calculus \nexisted and integrals weren't a thing  ",
        "start": 1543.92,
        "duration": 3.44
    }, {
        "text": "and we wanted to approximate an answer to this \nquestion, one way we could go about it is to take  ",
        "start": 1547.36,
        "duration": 4.72
    }, {
        "text": "a sample of values for theta that ranges \nfrom 0 up to 180 degrees. We might think  ",
        "start": 1552.08,
        "duration": 5.36
    }, {
        "text": "of them as evenly spaced, with some sort of \ndifference between each one, some delta-theta.",
        "start": 1557.44,
        "duration": 4.4
    }, {
        "text": "And it's still the case that it would be unhelpful \nto ask about the probability of a particular value  ",
        "start": 1562.4,
        "duration": 4.4
    }, {
        "text": "of theta occurring, even if it's one in our \nsample. That probability would still be zero,  ",
        "start": 1566.8,
        "duration": 4.4
    }, {
        "text": "and it would be unhelpful. But what is helpful \nto ask is the probability of falling between two  ",
        "start": 1571.2,
        "duration": 5.28
    }, {
        "text": "different values from our sample, in this little \nband of latitude with a width of delta theta.",
        "start": 1576.48,
        "duration": 5.04
    }, {
        "text": "Based on our assumption that the distribution \nalong the sphere should be uniform,  ",
        "start": 1582.4,
        "duration": 3.84
    }, {
        "text": "that probability comes down to knowing the area \nof this band. More specifically, the chances  ",
        "start": 1586.24,
        "duration": 4.72
    }, {
        "text": "that a randomly chosen vector lands in that band \nshould be that area divided by the total surface  ",
        "start": 1590.96,
        "duration": 4.88
    }, {
        "text": "area of the sphere. To figure out that area, \nlet's first think of the radius of that band,  ",
        "start": 1595.84,
        "duration": 4.88
    }, {
        "text": "which if the radius of our sphere is 1 is \ndefinitely going to be smaller than 1. And  ",
        "start": 1600.72,
        "duration": 5.12
    }, {
        "text": "in fact, if we draw the appropriate little right \ntriangle here, you can see that that little radius  ",
        "start": 1605.84,
        "duration": 4.48
    }, {
        "text": "let's just say at the top of the band should be \nthe sine of our angle, the sine of theta. This  ",
        "start": 1610.32,
        "duration": 5.2
    }, {
        "text": "means that the circumference of the band should \nbe 2 pi times the sine of that angle. And then  ",
        "start": 1615.52,
        "duration": 5.12
    }, {
        "text": "the area of the band should be that circumference \ntimes its thickness, that little delta theta. Or  ",
        "start": 1620.64,
        "duration": 5.28
    }, {
        "text": "rather, the area of our band is approximately this \nquantity. What's important is that for a finer  ",
        "start": 1625.92,
        "duration": 5.12
    }, {
        "text": "sample of many more values of theta the accuracy \nof that approximation would get better and better.",
        "start": 1631.04,
        "duration": 5.12
    }, {
        "text": "Now remember, the reason we wanted this area is \nto know the probability of falling into that band,  ",
        "start": 1637.28,
        "duration": 4.96
    }, {
        "text": "which is this area divided by the surface area \nof the sphere, which we know to be 4 pi times  ",
        "start": 1642.24,
        "duration": 4.8
    }, {
        "text": "its radius squared. That's a value that you could \nalso compute with an integral similar to the one  ",
        "start": 1647.04,
        "duration": 4.8
    }, {
        "text": "that we're setting up now, but for now we can take \nit as a given, as a standard well-known formula.",
        "start": 1651.84,
        "duration": 4.16
    }, {
        "text": "And this probability itself is just a stepping \nstone in the direction of what we actually want,  ",
        "start": 1656.72,
        "duration": 4.16
    }, {
        "text": "which is the average area \nfor the shadow of a square.  ",
        "start": 1660.88,
        "duration": 2.4
    }, {
        "text": "To get that we'll multiply this probability times \nthe corresponding shadow area, which is this  ",
        "start": 1664.08,
        "duration": 5.12
    }, {
        "text": "absolute value of cosine theta expression \nwe've seen many times up to this point.  ",
        "start": 1669.2,
        "duration": 3.68
    }, {
        "text": "And our estimate for this average would \nnow come down to adding up this expression  ",
        "start": 1673.52,
        "duration": 4.08
    }, {
        "text": "across all of the different bands, all of the \ndifferent samples of theta that we've taken.",
        "start": 1677.6,
        "duration": 4.24
    }, {
        "text": "This right here, by the way, is when \nBob is just totally in his element.  ",
        "start": 1683.36,
        "duration": 2.96
    }, {
        "text": "We've got a lot of exact formulas \ndescribing something very concrete,  ",
        "start": 1686.32,
        "duration": 3.36
    }, {
        "text": "actually digging in on our way to a real answer. \nAnd again, if it feels like a lot of detail,  ",
        "start": 1689.68,
        "duration": 5.12
    }, {
        "text": "I want you to appreciate that fact so that you \ncan appreciate just how magical it is when Alice  ",
        "start": 1694.8,
        "duration": 4.72
    }, {
        "text": "manages to somehow avoid all of this. Anyway, \nlooking back at our expression, let's clean  ",
        "start": 1699.52,
        "duration": 5.28
    }, {
        "text": "things up a little bit, like factoring out all \nof the terms that don't depend on theta itself.  ",
        "start": 1704.8,
        "duration": 4.08
    }, {
        "text": "And we can simplify that 2 pi divided by 4 pi to \nsimply be one half. And to make it a little more  ",
        "start": 1709.44,
        "duration": 5.76
    }, {
        "text": "analogous to calculus with integrals, let me \njust swap the main terms inside the sum here.",
        "start": 1715.2,
        "duration": 4.48
    }, {
        "text": "What we now have, this sum that's going \nto approximate the answer to our question,  ",
        "start": 1719.68,
        "duration": 4.24
    }, {
        "text": "is almost what an integral is. Instead of writing \nthe sigma for sum, we write the integral symbol,  ",
        "start": 1723.92,
        "duration": 5.68
    }, {
        "text": "this kind of elongated Leibnizian S showing us \nthat we're going from zero to pi. And instead  ",
        "start": 1729.6,
        "duration": 5.28
    }, {
        "text": "of describing the step size as delta theta, a \nconcrete finite amount, we instead describe it as  ",
        "start": 1734.88,
        "duration": 5.28
    }, {
        "text": "\"d\" theta, which I like to think of as signaling \nthe fact that some kind of limit is being taken.",
        "start": 1740.16,
        "duration": 4.88
    }, {
        "text": "What that integral means, by definition, is \nwhatever the sum on the bottom approaches  ",
        "start": 1745.92,
        "duration": 5.76
    }, {
        "text": "for finer and finer subdivisions, more dense \nsamples that we might take for theta itself.  ",
        "start": 1751.68,
        "duration": 5.12
    }, {
        "text": "And at this point, for those of you who do know \ncalculus, I'll just write down the details of how  ",
        "start": 1758.8,
        "duration": 4.24
    }, {
        "text": "you would actually carry this out as you might see \nit written down in Bob's notebook. It's the usual  ",
        "start": 1763.04,
        "duration": 5.04
    }, {
        "text": "anti-derivative stuff, but the one key step \nis to bring in a certain trig identity.  ",
        "start": 1768.08,
        "duration": 4.08
    }, {
        "text": "In the end, what Bob finds after doing \nthis is the surprisingly clean fact  ",
        "start": 1773.28,
        "duration": 4.48
    }, {
        "text": "that the average area for a square's shadow \nis precisely one-half the area of that square.  ",
        "start": 1777.76,
        "duration": 5.68
    }, {
        "text": "This is the mystery constant \nwhich Alice doesn't yet know.  ",
        "start": 1784.48,
        "duration": 2.88
    }, {
        "text": "If Bob were to look over her shoulder and see \nthe work that she's done he could finish out  ",
        "start": 1788.0,
        "duration": 3.84
    }, {
        "text": "the problem right now. He plugs in the constant \nthat he just found and he knows the final answer.",
        "start": 1791.84,
        "duration": 4.16
    }, {
        "text": "And now, finally! With all of this as backdrop,  ",
        "start": 1800.4,
        "duration": 2.88
    }, {
        "text": "what is it that Alice does to \ncarry out the final solution?",
        "start": 1803.28,
        "duration": 3.28
    }, {
        "text": "I introduced her as someone who really \nlikes to generalize the results she finds.  ",
        "start": 1806.56,
        "duration": 4.0
    }, {
        "text": "And usually those generalizations end up as \ninteresting footnotes that aren't really material  ",
        "start": 1810.56,
        "duration": 4.48
    }, {
        "text": "for solving particular problems. But this is a \ncase where the generalization itself draws her to  ",
        "start": 1815.04,
        "duration": 5.44
    }, {
        "text": "a quantitative result. Remember, the substance of \nwhat she's found so far is that if you look at any  ",
        "start": 1820.48,
        "duration": 5.6
    }, {
        "text": "convex solid, then the average area for its shadow \nis going to be proportional to its surface area.  ",
        "start": 1826.08,
        "duration": 5.84
    }, {
        "text": "And critically, it'll be the same proportionality \nconstant across all of these solids. So all Alice  ",
        "start": 1831.92,
        "duration": 6.0
    }, {
        "text": "needs to do is find just a single convex solid out \nthere where she already knows the average area of  ",
        "start": 1837.92,
        "duration": 5.84
    }, {
        "text": "its shadow. And some of you may see where this is \ngoing, the most symmetric solid available to us is  ",
        "start": 1843.76,
        "duration": 5.6
    }, {
        "text": "a sphere. No matter what the orientation of that \nsphere, its shadow, the flat projection shadow,  ",
        "start": 1849.36,
        "duration": 5.6
    }, {
        "text": "is always a circle with an area of pi r squared. \nSo in particular that's its average shadow area.  ",
        "start": 1854.96,
        "duration": 6.0
    }, {
        "text": "And the surface area of a sphere, like I \nmentioned before, is exactly 4 pi r squared.",
        "start": 1861.68,
        "duration": 4.64
    }, {
        "text": "By the way, I did make a video talking \nall about that surface area formula,  ",
        "start": 1866.88,
        "duration": 3.6
    }, {
        "text": "and how Archimedes proved it thousands of years \nbefore calculus existed. So you don't need  ",
        "start": 1870.48,
        "duration": 4.56
    }, {
        "text": "integrals to find it. The magic of what Alice \nhas done is that she can take this seemingly  ",
        "start": 1875.04,
        "duration": 4.72
    }, {
        "text": "specific fact, that the shadow of a sphere has \nan area exactly one-fourth its surface area,  ",
        "start": 1879.76,
        "duration": 5.36
    }, {
        "text": "and use it to conclude a much more general \nfact, that for any convex solid out there  ",
        "start": 1885.12,
        "duration": 4.32
    }, {
        "text": "its shadow and surface area \nare related in the same way,  ",
        "start": 1889.44,
        "duration": 3.04
    }, {
        "text": "in a certain sense. Wo with that she can go and \nfill in the details of the particular question  ",
        "start": 1892.48,
        "duration": 5.12
    }, {
        "text": "about a cube and say that its average shadow area \nwill be one-fourth times its surface area, 6s^2.",
        "start": 1897.6,
        "duration": 5.52
    }, {
        "text": "But the much more memorable fact that \nshe'll go to sleep thinking about  ",
        "start": 1904.16,
        "duration": 3.12
    }, {
        "text": "is how it didn't really matter that \nwe were talking about a cube at all.",
        "start": 1907.28,
        "duration": 3.12
    }, {
        "text": "Now, that's all very pretty, but some of you might \ncomplain that this isn't really a valid argument,  ",
        "start": 1912.32,
        "duration": 4.72
    }, {
        "text": "because spheres don't have flat faces. When I said \nAlice's argument generalizes to any convex solid,  ",
        "start": 1917.04,
        "duration": 6.4
    }, {
        "text": "if we actually look at the argument itself, \nit definitely depends on the use of a finite  ",
        "start": 1923.44,
        "duration": 4.32
    }, {
        "text": "number of flat faces. For example, if \nwe were mapping it to a dodecahedron,  ",
        "start": 1927.76,
        "duration": 3.92
    }, {
        "text": "you would start by saying that the area of \na particular shadow of that dodokahedron  ",
        "start": 1931.68,
        "duration": 4.24
    }, {
        "text": "looks like exactly one half times the sum of \nthe areas of the shadows of all its faces.",
        "start": 1935.92,
        "duration": 4.8
    }, {
        "text": "Snce again you could use a certain \nray-of-light-mixed-with-convexity argument  ",
        "start": 1940.72,
        "duration": 3.44
    }, {
        "text": "to draw that conclusion. And remember the benefit \nof expressing that shadow area as a sum is that  ",
        "start": 1944.16,
        "duration": 6.16
    }, {
        "text": "when we want to average over a bunch of different \nrotations, we can describe that sum as a big grid,  ",
        "start": 1950.32,
        "duration": 5.52
    }, {
        "text": "where we can then go column-by-column and consider \nthe average area for the shadow of each face.  ",
        "start": 1955.84,
        "duration": 4.8
    }, {
        "text": "And also, a critical fact was the conclusion from \nmuch earlier that the average shadow for any 2d  ",
        "start": 1961.2,
        "duration": 4.88
    }, {
        "text": "object (a flat 2d object, which is important) \nwill equal some universal proportionality  ",
        "start": 1966.08,
        "duration": 5.28
    }, {
        "text": "constant times its area. The significance was that \nthat constant didn't depend on the shape itself,  ",
        "start": 1971.36,
        "duration": 4.72
    }, {
        "text": "it could have been a square, or a cat, or the \npentagonal faces of our dodecahedron, whatever.",
        "start": 1976.08,
        "duration": 4.72
    }, {
        "text": "So after hastily carrying this over to a sphere \nthat doesn't have a finite number of flat faces,  ",
        "start": 1981.44,
        "duration": 5.6
    }, {
        "text": "you would be right to complain. But luckily, \nit's a pretty easy detail to fill in.  ",
        "start": 1987.04,
        "duration": 4.4
    }, {
        "text": "What you can do is imagine a sequence of different \npolyhedra that successively approximate a sphere,  ",
        "start": 1991.44,
        "duration": 5.68
    }, {
        "text": "in the sense that their faces hug tighter and \ntighter around the genuine surface of the sphere.  ",
        "start": 1997.12,
        "duration": 4.0
    }, {
        "text": "For each one of those approximations, we can draw \nthe same conclusion that its average shadow is  ",
        "start": 2001.84,
        "duration": 4.8
    }, {
        "text": "going to be proportional to its surface area, with \nthis universal proportionality constant. So then,  ",
        "start": 2006.64,
        "duration": 4.72
    }, {
        "text": "if we say \"okay, let's take the limit of the \nratio between the average shadow area at each step  ",
        "start": 2011.36,
        "duration": 5.36
    }, {
        "text": "and the surface area at each step...\" Well, since \nthat ratio is never changing, it's always equal to  ",
        "start": 2016.72,
        "duration": 4.72
    }, {
        "text": "this constant, then in the limit it's also going \nto equal that constant. But on the other hand,  ",
        "start": 2021.44,
        "duration": 4.96
    }, {
        "text": "by their definition, in the limit their average \nshadow area should be that of a circle which is  ",
        "start": 2026.4,
        "duration": 4.96
    }, {
        "text": "pi r squared, and the limit of the surface areas \nwould be the surface area of the sphere, 4 pi  ",
        "start": 2031.36,
        "duration": 5.04
    }, {
        "text": "r squared. So we do genuinely get the conclusion \nthat intuition would suggest, but as is so common  ",
        "start": 2036.4,
        "duration": 5.84
    }, {
        "text": "with Alice's argument here, we do have to be a \nlittle delicate in how we justify that intuition.",
        "start": 2042.24,
        "duration": 4.72
    }, {
        "text": "It's easy for this contrast of Alice and \nBob to come across like a value judgment,  ",
        "start": 2052.32,
        "duration": 4.56
    }, {
        "text": "as if I'm saying \"Look how \nclever Alice has managed to be!  ",
        "start": 2056.88,
        "duration": 2.96
    }, {
        "text": "She insightfully avoided all those \ncomputations that Bob had to do.\"",
        "start": 2059.84,
        "duration": 3.28
    }, {
        "text": "But that would be a very...misguided conclusion.  ",
        "start": 2064.0,
        "duration": 3.84
    }, {
        "text": "I think there's an important way that \npopularizations of math differ from the  ",
        "start": 2068.4,
        "duration": 3.76
    }, {
        "text": "feeling of actually doing math. There's this bias \ntowards showing the slick proofs, the arguments  ",
        "start": 2072.16,
        "duration": 5.12
    }, {
        "text": "with some clever key insight that lets you avoid \ndoing calculations. I could just be projecting,  ",
        "start": 2077.28,
        "duration": 5.2
    }, {
        "text": "since I'm very guilty of this, but what I can tell \nyou sitting on the other side of the screen here  ",
        "start": 2082.48,
        "duration": 4.56
    }, {
        "text": "is that it feels a lot more attractive to make a \nvideo about Alice's approach than Bob's. For one,  ",
        "start": 2087.04,
        "duration": 5.52
    }, {
        "text": "thing in Alice's approach the line of reasoning \nis fun. It has these nice aha moments.",
        "start": 2092.56,
        "duration": 4.88
    }, {
        "text": "But also, crucially, the way that you explain it \nis more or less the same for a very wide range  ",
        "start": 2097.44,
        "duration": 5.12
    }, {
        "text": "of mathematical backgrounds. It's much less \nenticing to do a video about bob's approach,  ",
        "start": 2102.56,
        "duration": 4.88
    }, {
        "text": "not because the computations are all \nthat bad. I mean they're honestly not.  ",
        "start": 2107.44,
        "duration": 3.76
    }, {
        "text": "But the pragmatic reality is that \nthe appropriate pace to explain it  ",
        "start": 2111.2,
        "duration": 3.76
    }, {
        "text": "looks very different depending on the different \nmathematical backgrounds in the audience.",
        "start": 2114.96,
        "duration": 3.84
    }, {
        "text": "So you watching this right now \nclearly consume math videos online,  ",
        "start": 2119.6,
        "duration": 4.08
    }, {
        "text": "and I think in doing so it's \nworth being aware of this bias.",
        "start": 2123.68,
        "duration": 3.28
    }, {
        "text": "If the aim is to have a genuine lesson on problem \nsolving, too much focus on the slick proofs runs  ",
        "start": 2126.96,
        "duration": 5.76
    }, {
        "text": "the risk of being disingenuous. For example let's \nsay we were to step up to challenge mode here  ",
        "start": 2132.72,
        "duration": 6.0
    }, {
        "text": "and ask about the case with a closer light source. \nTo my knowledge there is not a similarly slick  ",
        "start": 2138.72,
        "duration": 5.28
    }, {
        "text": "solution to Alice's here, where you can \njust relate to a single shape like a sphere.  ",
        "start": 2144.0,
        "duration": 4.08
    }, {
        "text": "The much more productive warm-up to have done \nwould have been the calculus of Bob's approach.",
        "start": 2148.64,
        "duration": 4.56
    }, {
        "text": "And if you look at the history of this \nproblem, it was proved by Cauchy in 1832.  ",
        "start": 2154.0,
        "duration": 4.88
    }, {
        "text": "And if we paw through his handwritten notes,  ",
        "start": 2158.88,
        "duration": 2.4
    }, {
        "text": "they look a lot more similar to Bob's work than \nAlice's work. Right here at the top of page 11,  ",
        "start": 2161.28,
        "duration": 5.12
    }, {
        "text": "you can see what is essentially the same \nintegral that you and I set up in the middle.",
        "start": 2166.4,
        "duration": 3.92
    }, {
        "text": "On the other hand, the whole framing \nof the paper is to find a general fact,  ",
        "start": 2171.12,
        "duration": 3.76
    }, {
        "text": "not something specific like the case of \na cube, so if we were asking the question  ",
        "start": 2174.88,
        "duration": 4.24
    }, {
        "text": "which of these two mindsets correlates \nwith the act of discovering new math,  ",
        "start": 2179.12,
        "duration": 4.0
    }, {
        "text": "the right answer would almost certainly have \nto be a blend of both. But I would suggest that  ",
        "start": 2183.12,
        "duration": 5.12
    }, {
        "text": "many people don't assign enough weight to the \npart of that blend where you're eager to dive  ",
        "start": 2188.24,
        "duration": 4.96
    }, {
        "text": "into calculations. And I think there's some risk \nthat the videos I make might contribute to that.",
        "start": 2193.2,
        "duration": 4.8
    }, {
        "text": "In the podcast that I did with the \nmathematician Alex Kontorovich, he talked  ",
        "start": 2198.96,
        "duration": 3.76
    }, {
        "text": "about the often underappreciated importance of \njust drilling on computations to build intuition,  ",
        "start": 2202.72,
        "duration": 5.44
    }, {
        "text": "whether you're a student engaging with a new \nclass, or a practicing research mathematician  ",
        "start": 2208.16,
        "duration": 4.4
    }, {
        "text": "engaging with a new field of study. A listener \nactually wrote in to highlight what an impression  ",
        "start": 2212.56,
        "duration": 4.88
    }, {
        "text": "that particular section made. They're a Ph.D. \nstudent, and described themselves as being worried  ",
        "start": 2217.44,
        "duration": 4.96
    }, {
        "text": "that their mathematical abilities were starting to \nfade, which they attributed to becoming older and  ",
        "start": 2222.4,
        "duration": 4.56
    }, {
        "text": "less sharp. But hearing a practicing mathematician \ntalk about the importance of doing hundreds of  ",
        "start": 2226.96,
        "duration": 4.88
    }, {
        "text": "concrete examples in order to learn something \nnew, evidently that changed their perspective.  ",
        "start": 2231.84,
        "duration": 4.88
    }, {
        "text": "In their own words, recognizing this completely \nreshaped their outlook and their results.  ",
        "start": 2236.72,
        "duration": 4.32
    }, {
        "text": "And if you look at the famous mathematicians \nthrough history, You know Newton, Euler, Gauss,  ",
        "start": 2241.76,
        "duration": 3.84
    }, {
        "text": "all of them, they all have this seemingly \ninfinite patience for doing tedious calculations.",
        "start": 2245.6,
        "duration": 4.96
    }, {
        "text": "The irony of being biased to show insights \nthat let us avoid calculations is that the  ",
        "start": 2251.12,
        "duration": 5.2
    }, {
        "text": "way people often train up the intuitions \nto find those insights in the first place  ",
        "start": 2256.32,
        "duration": 4.0
    }, {
        "text": "is by doing piles and piles of calculations.",
        "start": 2260.32,
        "duration": 2.24
    }, {
        "text": "All that said, something would definitely \nbe missing without the Alice mindset here.",
        "start": 2264.88,
        "duration": 4.8
    }, {
        "text": "I mean think about it how sad would it \nbe if we solved this problem for a cube,  ",
        "start": 2269.68,
        "duration": 3.52
    }, {
        "text": "and we never stepped outside of the trees \nto see the forest and understand that  ",
        "start": 2273.2,
        "duration": 3.6
    }, {
        "text": "this is a super general fact, it \napplies to a huge family of shapes.  ",
        "start": 2276.8,
        "duration": 3.44
    }, {
        "text": "And if you consider that math is not just about \nanswering the questions that are posed to you,  ",
        "start": 2281.28,
        "duration": 4.08
    }, {
        "text": "but about introducing new ideas and constructs, \none fun side note about Alice's approach here  ",
        "start": 2285.36,
        "duration": 5.44
    }, {
        "text": "is that it suggests a fun way to quantify the \nidea of convexity. Rather than just having a  ",
        "start": 2290.8,
        "duration": 5.36
    }, {
        "text": "yes/no answer, is it convex is it not, we could \nput a number to it by saying: Consider the average  ",
        "start": 2296.16,
        "duration": 5.28
    }, {
        "text": "area of the shadow of some solid, multiply \nthat by four, divide by the surface area,  ",
        "start": 2301.44,
        "duration": 5.44
    }, {
        "text": "and if that number is 1 you've got a \nconvex solid. But if it's less than 1,  ",
        "start": 2306.88,
        "duration": 3.84
    }, {
        "text": "it's non-convex, and how close it is to 1 \ntells you how close it is to being convex.",
        "start": 2310.72,
        "duration": 5.52
    }, {
        "text": "Also, one of the nice things about the Alice \nsolution here is that it helps explain why it  ",
        "start": 2316.96,
        "duration": 4.64
    }, {
        "text": "is that mathematicians have what can sometimes \nlook like a bizarre infatuation with generality,  ",
        "start": 2321.6,
        "duration": 5.6
    }, {
        "text": "and with abstraction. The more examples that \nyou see where generalizing and abstracting  ",
        "start": 2327.2,
        "duration": 4.72
    }, {
        "text": "actually helps you to solve a specific case, well \nthe more you start to adopt the same infatuation.",
        "start": 2331.92,
        "duration": 5.28
    }, {
        "text": "And as a final thought, for the stalwart viewers \namong you who've stuck through it this far,  ",
        "start": 2338.96,
        "duration": 3.84
    }, {
        "text": "there is still one unanswered question \nabout the very premise of our puzzle.  ",
        "start": 2343.44,
        "duration": 3.44
    }, {
        "text": "What exactly does it mean to choose a random \norientation? Now if that feels like a silly  ",
        "start": 2347.6,
        "duration": 4.96
    }, {
        "text": "question, like, of course we know what it should \nmean, I would encourage you to watch a video  ",
        "start": 2352.56,
        "duration": 3.52
    }, {
        "text": "that I just did with Numberphile on a conundrum \nfrom probability known as \"Bertrand's Paradox\".  ",
        "start": 2356.08,
        "duration": 4.64
    }, {
        "text": "After you watch it, and if you appreciate some of \nthe nuance at play here, homework for you is to  ",
        "start": 2361.36,
        "duration": 4.4
    }, {
        "text": "reflect on where exactly Alice and Bob implicitly \nanswered this question. The case with Bob is  ",
        "start": 2365.76,
        "duration": 6.4
    }, {
        "text": "relatively straightforward, but the point at which \nAlice locks down some specific distribution on the  ",
        "start": 2372.16,
        "duration": 5.28
    }, {
        "text": "space of all orientations...well it's not \nat all obvious, it's actually very subtle.",
        "start": 2377.44,
        "duration": 4.4
    }
]
